### **`now`** Function

#### Description
The PostgreSQL **`now`** function returns the current date and time with the time zone.

#### Syntax
The syntax for the **`now`** function in PostgreSQL is:
```
now()
```

#### Parameters or Arguments
There are no parameters or arguments for the now function.

#### Note
* The now function will return the current date as a `YYYY-MM-DD HH:MM:SS.US+TZ` format.

In [1]:
from utils.query_db import db_connection

with db_connection() as conn:
    conn.fetch_all("""SELECT now();""")

                               now
0 2023-03-25 13:36:24.479981+00:00

**Note**: The above implies that the timezone of our Postgres instance is set to UTC (or equivallent), which we can confirm by executing `SHOW timezone;`.

In [2]:
with db_connection() as conn:
    conn.fetch_all("""SHOW timezone;""")

  TimeZone
0  Etc/UTC

### **`current_date`** Function

#### Description
The PostgreSQL **`current_date`** function returns the current date.

#### Syntax
The syntax for the **`current_date`** function in PostgreSQL is:
```
current_date
```

#### Parameters or Arguments
There are no parameters or arguments for the now function.

#### Note
* The **`current_date`** function will return the current date as a `YYYY-MM-DD` format.
* Do not put parentheses () after the **`current_date`** function.

In [3]:
with db_connection() as conn:
    conn.fetch_all("""SELECT current_date;""")

  current_date
0   2023-03-25

**Note**: You can perform algebra with the result of **`current_date`** to add/substract days

In [4]:
with db_connection() as conn:
    conn.fetch_all("""SELECT current_date + 100 AS future_date;""")

  future_date
0  2023-07-03

### **`current_time`** Function

#### Description
The PostgreSQL **`current_time`** function returns the current time with the time zone.

#### Syntax
The syntax for the **`current_time`** function in PostgreSQL is:
```
current_time( [ precision ] )
```

#### Parameters or Arguments
* *`precision`* - Optional. The number of digits to round the fractional seconds to.

#### Note
* The **`current_time`** function will return the current time of day as a `HH:MM:SS.US+TZ` format.
* Do not put parentheses () after the **`current_time`** function when the *`precision`* parameter is not specified.

In [5]:
with db_connection() as conn:
    conn.fetch_all("""SELECT current_time;""")
    conn.fetch_all("""SELECT current_time(0);""")
    conn.fetch_all("""SELECT current_time(1);""")
    conn.fetch_all("""SELECT current_time(2);""")

            current_time
0  13:36:24.575869+00:00

     current_time
0  13:36:25+00:00

            current_time
0  13:36:24.600000+00:00

            current_time
0  13:36:24.580000+00:00

### **`extract`** Function

#### Description
The PostgreSQL **`extract`** function extracts parts from a date.

#### Syntax
The syntax for the **`extract`** function in PostgreSQL is:
```
extract( unit FROM date )
```

#### Parameters or Arguments
* *`date`* - T date, timestamp, time, or interval value from which the date part is to be extracted.
* *`unit`* - The unit type of the interval such as day, month, minute, hour, and so on. It can be one of the following:
    * `'century'` - Uses the Gregorian calendar where the first century starts at `0001-01-01 00:00:00 AD`.
    * `'day'` - Day of the month (1 to 31).
    * `'decade'` - Year divided by 10.
    * `'dow'` - Day of the week (0=Sunday, 1=Monday, 2=Tuesday, ... 6=Saturday).
    * `'doy'` - Day of the year (1=first day of year, 365/366=last day of the year, depending if it is a leap year).
    * `'epoch'` - Number of seconds since `'1970-01-01 00:00:00 UTC'`, if date value. Number of seconds in an interval, if interval value.
    * `'hour'` - Hour (0 to 23).
    * `'isodow'` - Day of the week (1=Monday, 2=Tuesday, 3=Wednesday, ... 7=Sunday).
    * `'isoyear'` - ISO 8601 year value (where the year begins on the Monday of the week that contains January 4th).
    * `'microseconds'` - Seconds (and fractional seconds) multiplied by 1,000,000.
    * `'millennium'` - Millennium value.
    * `'milliseconds'` - Seconds (and fractional seconds) multiplied by 1,000.
    * `'minute'` - Minute (0 to 59).
    * `'month'` - Number for the month (1 to 12), if date value. Number of months (0 to 11), if interval value.
    * `'quarter'` - Quarter (1 to 4).
    * `'second'` - Seconds (and fractional seconds).
    * `'timezone'` - Time zone offset from UTC, expressed in seconds.
    * `'timezone_hour'` - Hour portion of the time zone offset from UTC.
    * `'timezone_minute'` - Minute portion of the time zone offset from UTC.
    * `'week'` - Number of the week of the year based on ISO 8601 (where the year begins on the Monday of the week that contains January 4th).
    * `'year'` - Year as 4-digits.

#### Note
* See also the [**`date_part`** function](https://www.techonthenet.com/postgresql/functions/date_part.php).

In [6]:
with db_connection() as conn:
    conn.fetch_all("""
        SELECT SUM(amount) AS sum_payments, 
               extract('month' FROM payment_date) as month
        FROM payment
        GROUP BY extract('month' FROM payment_date)
        ORDER BY month;
    """)

  sum_payments month
0      8351.84     2
1     23886.56     3
2     28559.46     4
3       514.18     5

### **`age`** Function

#### Description
TThe PostgreSQL **`age`**  function returns the number of years, months, and days between two dates.

#### Syntax
The syntax for the **`age`** function in PostgreSQL is:
```
age( [date1,] date2 )
```

#### Parameters or Arguments
* *`date1`* and *`date2`* - The two dates to calculate the difference between. 

#### Calculation
The **`age`** function performs two different calculations depending on what parameters are provided.

If *`date1`* is provided, the **`age`** function performs the following calculation:

```date1 - date2```

If *`date1`* is NOT provided, the **`age`** function performs the following calculation:

```current date - date2```

#### Note
The age function will return the result as one of the following formats:
* *xxx year(s) xxx mon(s) xxx day(s)*
* *xxx mon(s) xxx day(s)*
* *xxx day(s)*

In [7]:
with db_connection() as conn:
    conn.fetch_all("""
        SELECT age(payment_date) AS time_since_payment
        FROM payment;
    """)

             time_since_payment
0     5879 days 01:34:13.003423
1     5878 days 06:36:45.003423
2     5878 days 01:18:14.003423
3     5875 days 04:20:03.003423
4     5874 days 06:28:11.003423
...                         ...
14591 5785 days 10:15:30.003423
14592 5785 days 10:15:30.003423
14593 5785 days 10:15:30.003423
14594 5785 days 10:15:30.003423
14595 5785 days 10:15:30.003423

[14596 rows x 1 columns]

#### **`extract`** challenges

* How many payments occured on a Monday?

In [8]:
with db_connection() as conn:
    conn.fetch_all("""
        SELECT COUNT(payment_id) AS num_payments
        FROM payment
        GROUP BY extract('isodow' FROM payment_date)
        HAVING extract('isodow' FROM payment_date) = 1;
    """)

   num_payments
0          2948